In [2]:
import pandas as pd
import numpy as np

In [21]:
dict1={'Names':['Luffy','Zoro',np.nan,'Nami'],
      'Age':[np.nan,20,25,20],
      'City':['Hyd','Blr','Chennai',np.nan]}
dict1

{'Names': ['Luffy', 'Zoro', nan, 'Nami'],
 'Age': [nan, 20, 25, 20],
 'City': ['Hyd', 'Blr', 'Chennai', nan]}

In [22]:
d1 = pd.DataFrame(dict1)
d1

   Names   Age     City
0  Luffy   NaN      Hyd
1   Zoro  20.0      Blr
2    NaN  25.0  Chennai
3   Nami  20.0      NaN

In [23]:
d1.dtypes

Names     object
Age      float64
City      object
dtype: object

In [8]:
dict2={'Names':['Luffy','Zoro',None,'Nami'],
      'Age':[np.nan,20,25,20],
      'City':['Hyd','Blr','Chennai',None]}
pd.DataFrame(dict2)

   Names   Age     City
0  Luffy   NaN      Hyd
1   Zoro  20.0      Blr
2   None  25.0  Chennai
3   Nami  20.0     None

In [24]:
d1.isnull()

   Names    Age   City
0  False   True  False
1  False  False  False
2   True  False  False
3  False  False   True

In [25]:
d1.isnull().sum() # For each column how many Nan is there it shows

Names    1
Age      1
City     1
dtype: int64

In [14]:
d1.isnull().sum()*100/len(d1)

Names    25.0
Age      25.0
City     25.0
dtype: float64

- np.nan : not a number
- This is applicable for numerical columns only

- Generally data has some empty rows
- It is a data problem
- If you read that kind of data you will see Null
- So we need to understand the data is corrupted or really a Null values are there

**Method-1**

**Fill with some random values**

**Method name:** fill na

In [15]:
d1.fillna(40)

   Names   Age     City
0  Luffy  40.0      Hyd
1   Zoro  20.0      Blr
2     40  25.0  Chennai
3   Nami  20.0       40

**Method-2**

- We can fill the values wrt columns

In [20]:
d1['Age'].fillna(40,inplace=True)

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_10864\3209254909.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  d1['Age'].fillna(40,inplace=True)

In [27]:
d1.fillna({'Age':40},inplace=True)
d1

   Names   Age     City
0  Luffy  40.0      Hyd
1   Zoro  20.0      Blr
2    NaN  25.0  Chennai
3   Nami  20.0      NaN

In [30]:
dict1={'Names':['Luffy','Zoro',np.nan,'Nami'],
      'Age':[np.nan,20,25,20],
      'City':['Hyd','Blr','Chennai',np.nan]}
d1 = pd.DataFrame(dict1)
d1

   Names   Age     City
0  Luffy   NaN      Hyd
1   Zoro  20.0      Blr
2    NaN  25.0  Chennai
3   Nami  20.0      NaN

**Method-3**

- bfill
- ffill
- pad
- backfill

In [31]:
d1.fillna(method='bfill')
# It will fill with below value or next value
# Column-1: Names index 2 is missing, it is filled with index 3 value
# Column-2: Age index 1 is missing, it is filled with index 2 value
# Column-3: City index 3 is missing, it should fill with next value but there is no value.
# So it will fill with below value

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_10864\2879503467.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='bfill')

   Names   Age     City
0  Luffy  20.0      Hyd
1   Zoro  20.0      Blr
2   Nami  25.0  Chennai
3   Nami  20.0      NaN

In [35]:
dict1={'Names':['Luffy','Zoro',np.nan,'Nami'],
      'Age':[np.nan,20,25,20],
      'City':['Hyd','Blr','Chennai',np.nan]}
d1 = pd.DataFrame(dict1)
d1.fillna(method='ffill')
# ffill means previous value assigned to missing value

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_10864\1238974477.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='ffill')

   Names   Age     City
0  Luffy   NaN      Hyd
1   Zoro  20.0      Blr
2   Zoro  25.0  Chennai
3   Nami  20.0  Chennai

In [37]:
dict1={'Names':['Luffy','Zoro',np.nan,'Nami'],
      'Age':[np.nan,20,25,20],
      'City':['Hyd','Blr','Chennai',np.nan]}
d1 = pd.DataFrame(dict1)
d1.fillna(axis=1, method='ffill') 
# axis=1 means column
# So NaN values will fill with next column values

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_10864\4156752121.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(axis=1, method='ffill')

   Names    Age     City
0  Luffy  Luffy      Hyd
1   Zoro   20.0      Blr
2    NaN   25.0  Chennai
3   Nami   20.0     20.0

In [38]:
dict1={'Names':['Luffy','Zoro',np.nan,'Nami'],
      'Age':[np.nan,20,25,20],
      'City':['Hyd','Blr','Chennai',np.nan]}
d1 = pd.DataFrame(dict1)
d1.fillna(method='pad')

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_10864\3941001692.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  d1.fillna(method='pad')

   Names   Age     City
0  Luffy   NaN      Hyd
1   Zoro  20.0      Blr
2   Zoro  25.0  Chennai
3   Nami  20.0  Chennai

- backfill and bfill fill with Next value
- pad and ffill fill with Previous value
- But it changes based on axis

**Method-4**

- Mean
    - Numerical value will fill with mean value
    - But mean affect by outliers
    - If we don't have outliers it is best one
- Median
    - Numerical value will fill with median value
    - Wkt median values does not effect by outliers
    - So if outliers are there we can go with median
- Mode
    - Mode is useful for categorical data

In [39]:
dict1={'Names':['Luffy','Zoro',np.nan,'Nami'],
      'Age':[np.nan,20,25,20],
      'City':['Hyd','Blr','Chennai',np.nan]}
d1 = pd.DataFrame(dict1)

In [40]:
# We already know we can fill some value based on specific column using ffill
# d1.fillna(<random_number>)
# d1 represents all the columns
age_mean = d1['Age'].mean()
d1['Age'].fillna(age_mean)

0    21.666667
1    20.000000
2    25.000000
3    20.000000
Name: Age, dtype: float64

In [43]:
age_median = d1['Age'].median()
d1['Age'].fillna(age_median)

0    20.0
1    20.0
2    25.0
3    20.0
Name: Age, dtype: float64

In [45]:
d1['City'].mode()
# In this use case we are getting mode equal
# But in real time we will get clear mode value

0        Blr
1    Chennai
2        Hyd
Name: City, dtype: object

- Fill with random value
- Fill with random value wrt column
- Fill with methods
    - bfill
    - ffill
    - pad
    - backfill
- Fill with 
    - Mean
    - Median
    - Mode

**Method-5**

**KNN imputer**

- KNN means K-Nearest Neighbors
- K is a hyper parameter means user can use
- It is a distance metric: **Euclidean Distance**
- KNN imputer will take the mean of neighbors value
- The neighbors value can be provided by using value=k
- It is under sklearn package
- Under sklearn we have imputer method --> KnnImputer

<img src="https://vitalflux.com/wp-content/uploads/2020/12/Euclidean-Distance-formula-2.png" jsaction="VQAsE" class="sFlh5c pT0Scc iPVvYb" style="max-width: 651px; height: 287px; margin: 0px; width: 351px;" alt="Different Types of Distance Measures in Machine Learning - Analytics Yogi" jsname="kn3ccd" aria-hidden="false">

In [47]:
from sklearn.impute import KNNImputer
ki = KNNImputer()
ki.fit_transform(d1[['Age']])

array([[21.66666667],
       [20.        ],
       [25.        ],
       [20.        ]])